adventure-works/schemaspy/diagrams/tables/DimCustomer.1degree.dot
digraph "oneDegreeRelationshipsDiagram" {
  graph [    rankdir="RL"    bgcolor="#ffffff"    label="\nGenerated by SchemaSpy"    labeljust="l"    nodesep="0.18"    ranksep="0.46"    fontname="Helvetica"    fontsize="11"    ration="compress"  ];  node [    fontname="Helvetica"    fontsize="11"    shape="plaintext"  ];  edge [    arrowsize="0.8"  ];
  "DimCustomer":"GeographyKey":w -> "DimGeography":"GeographyKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactInternetSales":"CustomerKey":w -> "DimCustomer":"CustomerKey.type":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactSurveyResponse":"CustomerKey":w -> "DimCustomer":"CustomerKey.type":e [arrowhead=none dir=back arrowtail=crowodot];
  "DimCustomer" [
   label=<
    <TABLE BORDER="2" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="4"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="82" HEIGHT="16"><B>DimCustomer</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CustomerKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">CustomerKey</TD></TR></TABLE></TD><TD PORT="CustomerKey.type" ALIGN="LEFT">int identity[4]</TD></TR>
      <TR><TD PORT="GeographyKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">GeographyKey</TD></TR></TABLE></TD><TD PORT="GeographyKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="CustomerAlternateKey" COLSPAN="2" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">CustomerAlternateKey</TD></TR></TABLE></TD><TD PORT="CustomerAlternateKey.type" ALIGN="LEFT">nvarchar[30]</TD></TR>
      <TR><TD PORT="Title" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">Title</TD></TR></TABLE></TD><TD PORT="Title.type" ALIGN="LEFT">nvarchar[16]</TD></TR>
      <TR><TD PORT="FirstName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">FirstName</TD></TR></TABLE></TD><TD PORT="FirstName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="MiddleName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">MiddleName</TD></TR></TABLE></TD><TD PORT="MiddleName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="LastName" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">LastName</TD></TR></TABLE></TD><TD PORT="LastName.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="NameStyle" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">NameStyle</TD></TR></TABLE></TD><TD PORT="NameStyle.type" ALIGN="LEFT">bit[1]</TD></TR>
      <TR><TD PORT="BirthDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">BirthDate</TD></TR></TABLE></TD><TD PORT="BirthDate.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="MaritalStatus" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">MaritalStatus</TD></TR></TABLE></TD><TD PORT="MaritalStatus.type" ALIGN="LEFT">nchar[2]</TD></TR>
      <TR><TD PORT="Suffix" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">Suffix</TD></TR></TABLE></TD><TD PORT="Suffix.type" ALIGN="LEFT">nvarchar[20]</TD></TR>
      <TR><TD PORT="Gender" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">Gender</TD></TR></TABLE></TD><TD PORT="Gender.type" ALIGN="LEFT">nvarchar[2]</TD></TR>
      <TR><TD PORT="EmailAddress" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">EmailAddress</TD></TR></TABLE></TD><TD PORT="EmailAddress.type" ALIGN="LEFT">nvarchar[100]</TD></TR>
      <TR><TD PORT="YearlyIncome" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">YearlyIncome</TD></TR></TABLE></TD><TD PORT="YearlyIncome.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="TotalChildren" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">TotalChildren</TD></TR></TABLE></TD><TD PORT="TotalChildren.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="NumberChildrenAtHome" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">NumberChildrenAtHome</TD></TR></TABLE></TD><TD PORT="NumberChildrenAtHome.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="EnglishEducation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">EnglishEducation</TD></TR></TABLE></TD><TD PORT="EnglishEducation.type" ALIGN="LEFT">nvarchar[80]</TD></TR>
      <TR><TD PORT="SpanishEducation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">SpanishEducation</TD></TR></TABLE></TD><TD PORT="SpanishEducation.type" ALIGN="LEFT">nvarchar[80]</TD></TR>
      <TR><TD PORT="FrenchEducation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">FrenchEducation</TD></TR></TABLE></TD><TD PORT="FrenchEducation.type" ALIGN="LEFT">nvarchar[80]</TD></TR>
      <TR><TD PORT="EnglishOccupation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">EnglishOccupation</TD></TR></TABLE></TD><TD PORT="EnglishOccupation.type" ALIGN="LEFT">nvarchar[200]</TD></TR>
      <TR><TD PORT="SpanishOccupation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">SpanishOccupation</TD></TR></TABLE></TD><TD PORT="SpanishOccupation.type" ALIGN="LEFT">nvarchar[200]</TD></TR>
      <TR><TD PORT="FrenchOccupation" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">FrenchOccupation</TD></TR></TABLE></TD><TD PORT="FrenchOccupation.type" ALIGN="LEFT">nvarchar[200]</TD></TR>
      <TR><TD PORT="HouseOwnerFlag" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">HouseOwnerFlag</TD></TR></TABLE></TD><TD PORT="HouseOwnerFlag.type" ALIGN="LEFT">nchar[2]</TD></TR>
      <TR><TD PORT="NumberCarsOwned" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">NumberCarsOwned</TD></TR></TABLE></TD><TD PORT="NumberCarsOwned.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="AddressLine1" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">AddressLine1</TD></TR></TABLE></TD><TD PORT="AddressLine1.type" ALIGN="LEFT">nvarchar[240]</TD></TR>
      <TR><TD PORT="AddressLine2" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">AddressLine2</TD></TR></TABLE></TD><TD PORT="AddressLine2.type" ALIGN="LEFT">nvarchar[240]</TD></TR>
      <TR><TD PORT="Phone" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">Phone</TD></TR></TABLE></TD><TD PORT="Phone.type" ALIGN="LEFT">nvarchar[40]</TD></TR>
      <TR><TD PORT="DateFirstPurchase" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">DateFirstPurchase</TD></TR></TABLE></TD><TD PORT="DateFirstPurchase.type" ALIGN="LEFT">date[6]</TD></TR>
      <TR><TD PORT="CommuteDistance" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">CommuteDistance</TD></TR></TABLE></TD><TD PORT="CommuteDistance.type" ALIGN="LEFT">nvarchar[30]</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 1</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">18,484 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">2 &gt;</TD></TR>
    </TABLE>>
    URL="DimCustomer.html"
    target="_top"
    tooltip="DimCustomer"
  ];
  "DimGeography" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="89" HEIGHT="16"><B>DimGeography</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="GeographyKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="171" HEIGHT="16">GeographyKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="171" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 1</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">655 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">2 &gt;</TD></TR>
    </TABLE>>
    URL="DimGeography.html"
    target="_top"
    tooltip="DimGeography"
  ];
  "FactInternetSales" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="105" HEIGHT="16"><B>FactInternetSales</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ProductKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="OrderDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">OrderDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="DueDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">DueDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ShipDateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ShipDateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CustomerKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CustomerKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="PromotionKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">PromotionKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CurrencyKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CurrencyKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesOrderNumber" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderNumber</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesOrderLineNumber" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderLineNumber</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 8</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">60,398 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">2 &gt;</TD></TR>
    </TABLE>>
    URL="FactInternetSales.html"
    target="_top"
    tooltip="FactInternetSales"
  ];
  "FactSurveyResponse" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="122" HEIGHT="16"><B>FactSurveyResponse</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SurveyResponseKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="200" HEIGHT="16">SurveyResponseKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="DateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="200" HEIGHT="16">DateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CustomerKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="200" HEIGHT="16">CustomerKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductCategoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="200" HEIGHT="16">ProductCategoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductSubcategoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="200" HEIGHT="16">ProductSubcategoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 2</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">2,727 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">  </TD></TR>
    </TABLE>>
    URL="FactSurveyResponse.html"
    target="_top"
    tooltip="FactSurveyResponse"
  ];
}
